package com.javarush.test.level03.lesson12.home01;

/* Жить хорошо, а хорошо жить еще лучше
Вывести на экран надпись «Жить хорошо, а хорошо жить еще лучше»
*/

import org.omg.PortableInterceptor.SYSTEM_EXCEPTION;

public class Solution
{
    public static void main(String[] args)
    {
        //напишите тут ваш код
        System.out.println("Жить хорошо, а хорошо жить еще лучше");
    }
}
